tcfshcrw/playground/ESP32/src/Main.cpp
    }
    */
  #endif

  //enable ESP-NOW
  #ifdef ESPNOW_Enable
  dap_calculationVariables_st.rudder_brake_status=false;
  if(dap_config_st.payLoadPedalConfig_.pedal_type==0||dap_config_st.payLoadPedalConfig_.pedal_type==1||dap_config_st.payLoadPedalConfig_.pedal_type==2)
  {
    Serial.println("Starting ESP now tasks");
    ESPNow_initialize();
    xTaskCreatePinnedToCore(
                        ESPNOW_SyncTask,   
                        "ESPNOW_update_Task", 
                        10000,  
                        //STACK_SIZE_FOR_TASK_2,    
                        NULL,      
                        1,         
                        &Task6,    
                        0);     
    delay(500);
  }
  else
  {
    Serial.println("ESPNOW task did not started due to Assignment error, please usb connect to Simhub and finish Assignment.");
  }
  #endif
  Serial.println("Setup Controller");
  #ifdef CONTROLLER_SPECIFIC_VIDPID
    SetupController_USB(dap_config_st.payLoadPedalConfig_.pedal_type);
    delay(500);
  #endif  
  #ifndef CONTROLLER_SPECIFIC_VIDPID
  // init controller
  #if defined(BLUETOOTH_GAMEPAD) || defined(USB_JOYSTICK)
  SetupController();
  #endif
  //delay(3000);
  #endif


  Serial.println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif

  #ifdef USING_BUZZER
    if(dap_config_st.payLoadPedalConfig_.pedal_type==0)
    {
      delay(500);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
    }
    if(dap_config_st.payLoadPedalConfig_.pedal_type==1)
    {
      Buzzer.single_beep_ledc_fade(NOTE_A4,3072,1);
    }    
    if(dap_config_st.payLoadPedalConfig_.pedal_type==2)
    {
      delay(500);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
    }    
    //Buzzer.single_beep_tone(440,1500);
  #endif
}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters()
{
  dap_calculationVariables_st.updateFromConfig(dap_config_st);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st.payLoadPedalConfig_.pedalStartPosition, dap_config_st.payLoadPedalConfig_.pedalEndPosition);
  //stepper->findMinMaxLimits(dap_config_st.payLoadPedalConfig_.pedalStartPosition, dap_config_st.payLoadPedalConfig_.pedalEndPosition);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  tunePidValues(dap_config_st);

  // equalize pedal config for both tasks
  dap_config_st_local = dap_config_st;
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/
unsigned long joystick_state_last_update=millis();
void loop() {
  taskYIELD();
  /*
  #ifdef OTA_update
  server.handleClient();
  //delay(1);
  #endif
  */
  
  
}


/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/


//long lastCallTime = micros();
unsigned long cycleTimeLastCall = micros();
unsigned long minCyclesForFirToInit = 1000;
unsigned long firCycleIncrementer = 0;

float filteredReading_exp_filter = 0;
unsigned long printCycleCounter = 0;
unsigned long servoActionLast = millis();
bool servoIdleStatus=false;
uint printCntr = 0;


int64_t timeNow_pedalUpdateTask_l = 0;
int64_t timePrevious_pedalUpdateTask_l = 0;
#define REPETITION_INTERVAL_PEDALUPDATE_TASK (int64_t)0


uint32_t pos_printCount = 0;

uint32_t controlTask_stackSizeIdx_u32 = 0;
float Position_Next_Prev = 0.0f;

//IRAM_ATTR DAP_config_st dap_config_pedalUpdateTask_st;
DAP_config_st dap_config_pedalUpdateTask_st;
//void loop()

void pedalUpdateTask( void * pvParameters )
{

  for(;;){


    // measure callback time and continue, when desired period is reached
    timeNow_pedalUpdateTask_l = millis();
    int64_t timeDiff_pedalUpdateTask_l = ( timePrevious_pedalUpdateTask_l + REPETITION_INTERVAL_PEDALUPDATE_TASK) - timeNow_pedalUpdateTask_l;
    uint32_t targetWaitTime_u32 = constrain(timeDiff_pedalUpdateTask_l, 0, REPETITION_INTERVAL_PEDALUPDATE_TASK);
    delay(targetWaitTime_u32);
    timePrevious_pedalUpdateTask_l = millis();


    // controll cycle time. Delay did not work with the multi tasking, thus this workaround was integrated
    unsigned long now = micros();
    if (now - cycleTimeLastCall < PUT_TARGET_CYCLE_TIME_IN_US) // 100us = 10kHz
    {
      // skip 
      continue;
    }
    {
      // if target cycle time is reached, update last time
      cycleTimeLastCall = now;
    }

    // print the execution time averaged over multiple cycles
    if (dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
    {
      static CycleTimer timerPU("PU cycle time");
      timerPU.Bump();
    }




    // system identification mode
    #ifdef ALLOW_SYSTEM_IDENTIFICATION
      if (systemIdentificationMode_b == true)
      {
        measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_st, loadcell);
        systemIdentificationMode_b = false;
      }
    #endif
    

    

    

     

    // if a config update was received over serial, update the variables required for further computation
    if (configUpdateAvailable == true)
    {
      if(semaphore_updateConfig!=NULL)
      {

