tcfshcrw/playground/ESP32/src/Main.cpp
        bool configWasUpdated_b = false;
        // Take the semaphore and just update the config file, then release the semaphore
        if(xSemaphoreTake(semaphore_updateConfig, (TickType_t)1)==pdTRUE)
        {
          Serial.println("Updating pedal config");
          configUpdateAvailable = false;
          dap_config_st = dap_config_st_local;
          configWasUpdated_b = true;
          xSemaphoreGive(semaphore_updateConfig);
        }

        // update the calc params
        if (true == configWasUpdated_b)
        {
          Serial.println("Updating the calc params");
          configWasUpdated_b = false;

          if (true == dap_config_st.payLoadHeader_.storeToEeprom)
          {
            dap_config_st.payLoadHeader_.storeToEeprom = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
            uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
            dap_config_st.payloadFooter_.checkSum = crc;
            dap_config_st.storeConfigToEprom(dap_config_st); // store config to EEPROM
          }
          
          updatePedalCalcParameters(); // update the calc parameters
          moveSlowlyToPosition_b = true;
        }

      }
      else
      {
        semaphore_updateConfig = xSemaphoreCreateMutex();
        //Serial.println("semaphore_updateConfig == 0");
      }
    }

    // copy struct to local variable for faster execution
    dap_config_pedalUpdateTask_st = dap_config_st;
  

    //#define RECALIBRATE_POSITION
    #ifdef RECALIBRATE_POSITION
      stepper->checkLimitsAndResetIfNecessary();
    #endif


    // compute pedal oscillation, when ABS is active
    float absForceOffset = 0.0f;
    float absPosOffset = 0.0f;
    dap_calculationVariables_st.Default_pos();
    #ifdef ABS_OSCILLATION
      absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absPattern, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absForceOrTarvelBit, &absForceOffset, &absPosOffset);
      _RPMOscillation.trigger();
      _RPMOscillation.forceOffset(&dap_calculationVariables_st);
      _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
      _G_force_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_multi);
      _WSOscillation.forceOffset(&dap_calculationVariables_st);
      _Road_impact_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_multi);
      CV1.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_1,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_1);
      CV2.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_2,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_2);
      _rudder_g_force.offset_calculate(&dap_calculationVariables_st);
      dap_calculationVariables_st.update_stepperMaxpos(_rudder_g_force.offset_filter);
      _rudder.offset_calculate(&dap_calculationVariables_st);
      dap_calculationVariables_st.update_stepperMinpos(_rudder.offset_filter);


      //_rudder.force_offset_calculate(&dap_calculationVariables_st);

    #endif

    //update max force with G force effect
      movingAverageFilter.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_window;
      movingAverageFilter_roadimpact.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_window;
      dap_calculationVariables_st.reset_maxforce();
      dap_calculationVariables_st.Force_Max += _G_force_effect.G_force;
      dap_calculationVariables_st.Force_Max += _Road_impact_effect.Road_Impact_force;
      dap_calculationVariables_st.dynamic_update();
      dap_calculationVariables_st.updateStiffness();
    


    // Get the loadcell reading
    float loadcellReading = loadcell->getReadingKg();

    uint16_t angleReading_ui16 = 0;
    #ifdef ANGLE_SENSOR_GPIO
      angleReading_ui16 = analogRead(ANGLE_SENSOR_GPIO);
      // if (pos_printCount >= 100)
      // {
      //   Serial.printf("Ang.: %f\n", angleReading_ui16);
      //   pos_printCount = 0;
      // }
      // pos_printCount++;
    #endif

    // Get the angle measurement reading
    // float angleReading = loadcell->getAngleMeasurement();

    
    // if (pos_printCount >= 100)
    // {
    //   Serial.printf("Ang.: %f\n", angleReading);
    //   pos_printCount = 0;
    // }
    // pos_printCount++;
  

    // Invert the loadcell reading digitally if desired
    if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.invertLoadcellReading_u8 == 1)
    {
      loadcellReading *= -1;
    }


    // Convert loadcell reading to pedal force
    float sledPosition = sledPositionInMM(stepper, &dap_config_pedalUpdateTask_st, motorRevolutionsPerSteps_fl32);
    float pedalInclineAngleInDeg_fl32 = pedalInclineAngleDeg(sledPosition, &dap_config_pedalUpdateTask_st);
    float pedalForce_fl32 = convertToPedalForce(loadcellReading, sledPosition, &dap_config_pedalUpdateTask_st);
    float d_phi_d_x = convertToPedalForceGain(sledPosition, &dap_config_pedalUpdateTask_st);

    // Serial.printf("SledPos:%f,    PedalAngle: %f\n", sledPosition, pedalInclineAngleInDeg_fl32);

    // delay(10);

    // compute gain for horizontal foot model
    float b = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.lengthPedal_b;
    float d = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.lengthPedal_d;
    float d_x_hor_d_phi = -(b+d) * sinf(pedalInclineAngleInDeg_fl32 * DEG_TO_RAD_FL32);
    d_x_hor_d_phi *= DEG_TO_RAD_FL32; // inner derivative
    
    // Do the loadcell signal filtering
    float filteredReading = 0.0f;
    float changeVelocity = 0.0f;
    float alpha_exp_filter = 1.0f - ( (float)dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise) / 5000.0f;
    // const velocity model denoising filter
    switch (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelOrder) {
      case 0:
        filteredReading = kalman->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise);
        changeVelocity = kalman->changeVelocity();
        break;
      case 1:
        filteredReading = kalman_2nd_order->filteredValue(pedalForce_fl32, 0.0f, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise);
        changeVelocity = kalman_2nd_order->changeVelocity();
        break;
      case 2:
        filteredReading_exp_filter = filteredReading_exp_filter * alpha_exp_filter + pedalForce_fl32 * (1.0f-alpha_exp_filter);
        filteredReading = filteredReading_exp_filter;
        break;
      default:
        filteredReading_exp_filter = filteredReading_exp_filter * alpha_exp_filter + pedalForce_fl32 * (1.0f-alpha_exp_filter);
        filteredReading = filteredReading_exp_filter;
        break;
    }






    //#define DEBUG_FILTER
    if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_LOADCELL_READING) 
    {
      static RTDebugOutput<float, 3> rtDebugFilter({ "rawReading_g", "pedalForce_fl32", "filtered_g"});
      rtDebugFilter.offerData({ loadcellReading * 1000.0f, pedalForce_fl32*1000.0f, filteredReading * 1000.0f});
    }

    
    float FilterReadingJoystick=0.0f;
    if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_Joystick_u8==1)
    {
      FilterReadingJoystick=kalman_joystick->filteredValue(filteredReading,0.0f,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.kf_modelNoise_joystick);

