tcfshcrw/playground/ESP32/src/Main.cpp
    }
    else
    {
      FilterReadingJoystick=filteredReading;

    }

    //if filtered reading > min force, mark the servo was in aciton
    #ifdef SERVO_POWER_PIN
      if(filteredReading>dap_config_pedalUpdateTask_st.payLoadPedalConfig_.preloadForce)
      {
        servoActionLast=millis();
      }
    #endif

    //float FilterReadingJoystick=averagefilter_joystick.process(filteredReading);

    float stepperPosFraction = stepper->getCurrentPositionFraction();
    int32_t Position_Next = 0;
    
    // select control loop algo
    switch (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.control_strategy_b) {
      case 0:
        // static PID
        Position_Next = MoveByPidStrategy(filteredReading, stepperPosFraction, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity);
        break;
      case 1:
        // dynamic PID
        Position_Next = MoveByPidStrategy(filteredReading, stepperPosFraction, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity);
        break;
      default:
        // MPC
        Position_Next = MoveByForceTargetingStrategy(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0.0f/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
        // Position_Next = MoveByForceTargetingStrategy_old(filteredReading, stepper, &forceCurve, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, 0/*effect_force*/, changeVelocity, d_phi_d_x, d_x_hor_d_phi);
        break;
    }


    // float alphaPidOut = 0.9;
    // Position_Next = Position_Next*alphaPidOut + Position_Next_Prev * (1.0f - alphaPidOut);
    // Position_Next_Prev = Position_Next;

    // add dampening
    if (dap_calculationVariables_st.dampingPress  > 0.0001f)
    {
      // dampening is proportional to velocity --> D-gain for stability
      Position_Next -= dap_calculationVariables_st.dampingPress * changeVelocity * dap_calculationVariables_st.springStiffnesssInv;
    }
      


    // clip target position to configured target interval with RPM effect movement in the endstop
    Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax);
    
  
    // //Adding effects
    //Add effect by force
    float effect_force = _BitePointOscillation.BitePoint_Force_offset + _WSOscillation.WS_Force_offset + CV1.CV_Force_offset + CV2.CV_Force_offset;

    if(filteredReading>=dap_calculationVariables_st.Force_Min)
    {
      Position_Next -= absPosOffset;
      effect_force += absForceOffset;
    }
    int32_t Position_effect= effect_force/dap_calculationVariables_st.Force_Range*dap_calculationVariables_st.stepperPosRange;
    Position_Next -=_RPMOscillation.RPM_position_offset;

    Position_Next -= Position_effect;
    Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMinEndstop, dap_calculationVariables_st.stepperPosMaxEndstop);
    
    //bitepoint trigger
    int32_t BP_trigger_value = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger_value;
    int32_t BP_trigger_min = (BP_trigger_value-4);
    int32_t BP_trigger_max = (BP_trigger_value+4);
    int32_t Position_check = 100*((Position_Next-dap_calculationVariables_st.stepperPosMin) / dap_calculationVariables_st.stepperPosRange);
    int32_t Rudder_real_poisiton= 100*((Position_Next-dap_calculationVariables_st.stepperPosMin_default) / dap_calculationVariables_st.stepperPosRange_default);

    dap_calculationVariables_st.current_pedal_position = Position_Next;

    //Rudder initialzing and de initializing
    #ifdef ESPNOW_Enable
    if(dap_calculationVariables_st.Rudder_status)
    {
      if(Rudder_initializing)
      {
        moveSlowlyToPosition_b=true;
        //Serial.println("moving to center");
      }
      if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
      {
        if(Rudder_initialized_time==0)
        {
          Rudder_initialized_time=millis();
        }
        else
        {
          unsigned long Rudder_initialzing_time_Now = millis();
          //wait 3s for the initializing
          //Serial.print("Rudder initializing...");
          //Serial.println(Rudder_initialzing_time_Now-Rudder_initialized_time);
          if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
          {
            Rudder_initializing=false;
            moveSlowlyToPosition_b=false;
            Serial.println("Rudder initialized");
            Rudder_initialized_time=0;
            #ifdef USING_BUZZER
              Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
            #endif
          }
        }
        

      }
    }
    if(Rudder_deinitializing)
    {
      moveSlowlyToPosition_b=true;
        //Serial.println("moving to min end stop");
    }
    if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
    {
      Rudder_deinitializing=false;
      moveSlowlyToPosition_b=false;
      Serial.println("Rudder deinitialized");
    }
    #endif

    //Serial.println(Position_check);
    if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger==1)
    {
      if(Position_check > BP_trigger_min)
      {
        if(Position_check < BP_trigger_max)
        {
          _BitePointOscillation.trigger();
        }
      }
    }

    // if pedal in min position, recalibrate position --> automatic step loss compensation

    stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.stepLossFunctionFlags_u8);
    if (stepper->isAtMinPos())
    {
      #if defined(OTA_update_ESP32) || defined(OTA_update)
        if(OTA_status==false)
        {
          stepper->correctPos();
        }    
      #else
        stepper->correctPos();
      #endif

    }

    //pedal not in action, disable pedal power
    #ifdef SERVO_POWER_PIN
      if(stepper->servoStatus==SERVO_CONNECTED &&millis()-servoActionLast>MAXIMUM_STEPPER_IDLE_TIMEOUT)
      {
        stepper->servoIdleAction();
        stepper->servoStatus=SERVO_IDLE_NOT_CONNECTED;
        Buzzer.single_beep_tone(770,100);
        pixels.setPixelColor(0,0xff,0x00,0x00);//show red
        pixels.show(); 
        delay(300);
        Buzzer.single_beep_tone(770,100);
        Serial.println("Servo Idle timeout, please restart pedal.");

