tcfshcrw/playground/ESP32/src/Main.cpp
      }
    #endif

    // print all servo parameters for debug purposes
    if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS) )
    {
      // clear the debug bit
      dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS);
      delay(1000);  
			stepper->printAllServoParameters();
    }



    // if (pos_printCount == 1000)
    // {
    //   Serial.print("ESP pos: ");
    //   Serial.print(stepper->getCurrentPosition());
    //   Serial.print(", Serovs pos: ");
    //   Serial.print(stepper->getServosPos());
    //   Serial.print(", Serovs pos (corr.): ");
    //   Serial.println(stepper->getServosInternalPosition());
    //   pos_printCount = 0;
    // }
    // pos_printCount++;
    



    // Serial.print("Position next: ");
    // Serial.println(Position_Next);





  // Move to new position
  
  
  if (!moveSlowlyToPosition_b)
  {
    #if defined(OTA_update_ESP32) || defined(OTA_update)
      if(OTA_status==false)
      {
        stepper->moveTo(Position_Next, false);
      }
    #else
      stepper->moveTo(Position_Next, false);
    #endif
  }
  else
  {
    #if defined(OTA_update_ESP32) || defined(OTA_update)
      if(OTA_status==false)
      {
        moveSlowlyToPosition_b = false;
        stepper->moveSlowlyToPos(Position_Next);
      }
    #else
      moveSlowlyToPosition_b = false;
      stepper->moveSlowlyToPos(Position_Next);
    #endif

  }
  


    
     
    

    // compute controller output
    dap_calculationVariables_st.StepperPos_setback();
    dap_calculationVariables_st.reset_maxforce();
    dap_calculationVariables_st.dynamic_update();
    dap_calculationVariables_st.updateStiffness();
    

    // set joystick value
    if(semaphore_updateJoystick!=NULL)
    {
      if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE) {

        
        if(dap_calculationVariables_st.Rudder_status&&dap_calculationVariables_st.rudder_brake_status)
        {
          if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
          {
            joystickNormalizedToInt32 = NormalizeControllerOutputValue((Position_Next-dap_calculationVariables_st.stepperPosRange/2), dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMin+dap_calculationVariables_st.stepperPosRange/2.0f, dap_config_st.payLoadPedalConfig_.maxGameOutput);
            joystickNormalizedToInt32 = constrain(joystickNormalizedToInt32,0,JOYSTICK_MAX_VALUE);
          }
          else
          {
            joystickNormalizedToInt32 = NormalizeControllerOutputValue((FilterReadingJoystick/*filteredReading*/), dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
          }
        }
        else
        {
          if (1 == dap_config_pedalUpdateTask_st.payLoadPedalConfig_.travelAsJoystickOutput_u8)
          {
            joystickNormalizedToInt32 = NormalizeControllerOutputValue(Position_Next, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
          }
          else
          {            
            joystickNormalizedToInt32 = NormalizeControllerOutputValue(FilterReadingJoystick/*filteredReading*/, dap_calculationVariables_st.Force_Min, dap_calculationVariables_st.Force_Max, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.maxGameOutput);
          }
        }
        
        xSemaphoreGive(semaphore_updateJoystick);
      }
    }
    else
    {
      semaphore_updateJoystick = xSemaphoreCreateMutex();
    }

    // provide joystick output on PIN
    #ifdef Using_analog_output
      int dac_value=(int)(joystickNormalizedToInt32*255/10000);
      dacWrite(D_O,dac_value);
    #endif

    #ifdef Using_analog_output_ESP32_S3
      if(MCP_status)
      {
        int dac_value=(int)(joystickNormalizedToInt32*4096*0.9/10000);//limit the max to 5V*0.9=4.5V to prevent the overvolatage
        dac.setVoltage(dac_value, false);
      }
    #endif

    
    float normalizedPedalReading_fl32 = 0.0f;
    if ( fabs(dap_calculationVariables_st.Force_Range) > 0.01f)
    {
        normalizedPedalReading_fl32 = constrain((filteredReading - dap_calculationVariables_st.Force_Min) / dap_calculationVariables_st.Force_Range, 0.0f, 1.0f);
    }
    
    // simulate ABS trigger 
    if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_trigger==1)
    {
      int32_t ABS_trigger_value=dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Simulate_ABS_value;
      if( (normalizedPedalReading_fl32*100.0f) > ABS_trigger_value)
      {
        absOscillation.trigger();
      }
    }

    
//#ifdef UNCOMMENT
    // update pedal states
    if(semaphore_updatePedalStates!=NULL)
    {
      if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)1)==pdTRUE) 
      {
        
        
        // update basic pedal state struct
        dap_state_basic_st.payloadPedalState_Basic_.pedalForce_u16 =  normalizedPedalReading_fl32 * 65535.0f;
        dap_state_basic_st.payloadPedalState_Basic_.pedalPosition_u16 = constrain(stepperPosFraction, 0.0f, 1.0f) * 65535.0f;
        dap_state_basic_st.payloadPedalState_Basic_.joystickOutput_u16 = (float)joystickNormalizedToInt32 / 10000.0f * 32767.0f;//65535;
        parse_version(DAP_FIRMWARE_VERSION, &dap_state_basic_st.payloadPedalState_Basic_.pedalFirmwareVersion_u8[0], &dap_state_basic_st.payloadPedalState_Basic_.pedalFirmwareVersion_u8[1], &dap_state_basic_st.payloadPedalState_Basic_.pedalFirmwareVersion_u8[2]);
        //error code
        dap_state_basic_st.payloadPedalState_Basic_.erroe_code_u8=0;
        #ifdef ESPNOW_Enable
        if(ESPNow_error_code!=0)
        {
          dap_state_basic_st.payloadPedalState_Basic_.erroe_code_u8=ESPNow_error_code;
          ESPNow_error_code=0;
        }
        #endif
        //dap_state_basic_st.payloadPedalState_Basic_.erroe_code_u8=200;
        /*if(isv57.isv57_update_parameter_b)
        {
          dap_state_basic_st.payloadPedalState_Basic_.erroe_code_u8=11;
          isv57.isv57_update_parameter_b=false;
        }*/
        if( stepper->getLifelineSignal()==false && stepper->servoStatus!=SERVO_IDLE_NOT_CONNECTED)
        {
          dap_state_basic_st.payloadPedalState_Basic_.erroe_code_u8=12;
        }
        //fill the header
        dap_state_basic_st.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_STATE_BASIC;
        dap_state_basic_st.payLoadHeader_.version = DAP_VERSION_CONFIG;
        dap_state_basic_st.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_basic_st.payLoadHeader_)), sizeof(dap_state_basic_st.payLoadHeader_) + sizeof(dap_state_basic_st.payloadPedalState_Basic_));
        dap_state_basic_st.payLoadHeader_.PedalTag=dap_config_pedalUpdateTask_st.payLoadPedalConfig_.pedal_type;        
        
        
