tcfshcrw/playground/ESP32/src/Main.cpp
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                }
                if(dap_actions_st.payloadPedalAction_.Rudder_brake_action==1)
                {
                  if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                  {
                    dap_calculationVariables_st.rudder_brake_status=true;
                    Serial.println("Rudder brake on");
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                  else
                  {
                    dap_calculationVariables_st.rudder_brake_status=false;
                    Serial.println("Rudder brake off");
                    //Serial.print("status:");
                    //Serial.println(dap_calculationVariables_st.Rudder_status);
                  }
                }
                //clear rudder status
                if(dap_actions_st.payloadPedalAction_.Rudder_action==2)
                {
                  dap_calculationVariables_st.Rudder_status=false;
                  dap_calculationVariables_st.rudder_brake_status=false;
                  Serial.println("Rudder Status Clear");
                  Rudder_deinitializing=true;
                  moveSlowlyToPosition_b=true;

                }
              #endif


            }

            break;
          case sizeof(Basic_WIfi_info) : 
          Serial.println("get basic wifi info");
          Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
          #ifdef OTA_update
            if(_basic_wifi_info.device_ID==dap_config_st.payLoadPedalConfig_.pedal_type)
            {
              SSID=new char[_basic_wifi_info.SSID_Length+1];
              PASS=new char[_basic_wifi_info.PASS_Length+1];
              memcpy(SSID,_basic_wifi_info.WIFI_SSID,_basic_wifi_info.SSID_Length);
              memcpy(PASS,_basic_wifi_info.WIFI_PASS,_basic_wifi_info.PASS_Length);
              SSID[_basic_wifi_info.SSID_Length]=0;
              PASS[_basic_wifi_info.PASS_Length]=0;
              OTA_enable_b=true;
            }
          #endif
          #ifdef OTA_update_ESP32
            Serial.println("Get OTA command");
            OTA_enable_b=true;
            //OTA_enable_start=true;
            ESPNow_OTA_enable=false;
            //Serial.println("get basic wifi info");
            //Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
          #endif
          
          break;
          default:

            // flush the input buffer
            while (Serial.available()) Serial.read();
            //Serial.flush();

            Serial.println("\nIn byte size: ");
            Serial.println(n);
            Serial.println("    Exp config size: ");
            Serial.println(sizeof(DAP_config_st) );
            Serial.println("    Exp action size: ");
            Serial.println(sizeof(DAP_actions_st) );

            break;  


            

        }
      }


      // send pedal state structs
      // update pedal states
      printCycleCounter++;
      DAP_state_basic_st dap_state_basic_st_lcl;
      DAP_state_extended_st dap_state_extended_st_lcl;

      if(semaphore_updatePedalStates!=NULL)
      {
        
        if(xSemaphoreTake(semaphore_updatePedalStates, (TickType_t)1)==pdTRUE) 
        {
        
          // UPDATE basic pedal state struct
          dap_state_basic_st_lcl = dap_state_basic_st;

          // UPDATE extended pedal state struct
          dap_state_extended_st_lcl = dap_state_extended_st;
            
          // release semaphore
          xSemaphoreGive(semaphore_updatePedalStates);

        }
      }
      else
      {
        semaphore_updatePedalStates = xSemaphoreCreateMutex();
      }



      // send the pedal state structs
      // send basic pedal state struct
      if ( !(dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_BASIC_INFO_STRUCT) )
      {
        if (printCycleCounter >= 2)
        {
          printCycleCounter = 0;
          Serial.write((char*)&dap_state_basic_st_lcl, sizeof(DAP_state_basic_st));
          Serial.print("\r\n");
        }
      }

      if ( (dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT) )
      {
        Serial.write((char*)&dap_state_extended_st_lcl, sizeof(DAP_state_extended_st));
        Serial.print("\r\n");
      }

    }

    delay( SERIAL_COOMUNICATION_TASK_DELAY_IN_MS );
    if(semaphore_updateJoystick!=NULL)
    {
      if(xSemaphoreTake(semaphore_updateJoystick, (TickType_t)1)==pdTRUE)
      {
         //Serial.print(" 3");
        joystickNormalizedToInt32_local = joystickNormalizedToInt32;
        xSemaphoreGive(semaphore_updateJoystick);
      }
    }
    #if defined(USB_JOYSTICK) || defined(BLUETOOTH_GAMEPAD)
      if (IsControllerReady()) 
      {
        if(dap_calculationVariables_st.Rudder_status==false)
        {
          //general output
          SetControllerOutputValue(joystickNormalizedToInt32_local);
          
          #ifdef USB_JOYSTICK
            // Restart HID output if faulty behavior was detected
            JoystickSendState();
            if(!GetJoystickStatus())
            {
              RestartJoystick();
              Serial.println("HID Eroor, Restart Joystick...");
              //last_serial_joy_out=millis();
            }
          #endif

        }
      }
    #endif

    #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
      if( communicationTask_stackSizeIdx_u32 == 1000)
			{
				UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
				Serial.print("StackSize (Serial communication): ");
				Serial.println(stackHighWaterMark);
				communicationTask_stackSizeIdx_u32 = 0;
			}
			communicationTask_stackSizeIdx_u32++;
    #endif

  }
}



//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
int OTA_update_status=99;
void OTATask( void * pvParameters )
{

  for(;;)
  {
    
    if(OTA_count>200)
    {
      message_out_b=true;
      OTA_count=0;
    }
    else
    {
      OTA_count++;
    }

    #if defined(OTA_update)  || defined(OTA_update_ESP32)
    if(OTA_enable_b)
    {
      if(message_out_b)
      {
        message_out_b=false;
        Serial1.println("OTA enable flag on");
      }
      if(OTA_status)
      {
        #ifdef OTA_update_ESP32
          server.handleClient();
        #endif
        #ifdef OTA_update
          if(OTA_update_status==0)
          {
            #ifdef USING_BUZZER
              Buzzer.play_melody_tone(melody_victory_theme, sizeof(melody_victory_theme)/sizeof(melody_victory_theme[0]),melody_durations_Victory_theme);              
            #endif
            ESP.restart();
          }
          else
          {
            #ifdef USING_BUZZER
              Buzzer.single_beep_tone(770,100);
            #endif
            #ifdef USING_LED
            pixels.setPixelColor(0,0xff,0x00,0x00);//red
            pixels.show(); 
            delay(500);
            pixels.setPixelColor(0,0x00,0x00,0x00);//no color
            pixels.show();
            delay(500);    
            #endif 
          }

        #endif
        

