tcfshcrw/playground/ESP32/src/Main.cpp
              for(int i=0; i<4;i++)
              {
                if(_ESP_pairing_reg.Pair_status[i]==1)
                {
                  if(i==0)
                  {
                    ESPNow.remove_peer(Clu_mac);
                    memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                    delay(100);
                    ESPNow.add_peer(Clu_mac);
                    
                  }
                  if(i==1)
                  {
                    ESPNow.remove_peer(Brk_mac);
                    memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                    delay(100);
                    ESPNow.add_peer(Brk_mac);
                  }
                  if(i==2)
                  {
                    ESPNow.remove_peer(Gas_mac);
                    memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                    delay(100);
                    ESPNow.add_peer(Gas_mac);
                  }        
                  if(i==3)
                  {
                    ESPNow.remove_peer(esp_Host);
                    memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                    delay(100);
                    ESPNow.add_peer(esp_Host);                
                  }        
                  if(dap_config_st.payLoadPedalConfig_.pedal_type==1)
                  {
                    Recv_mac=Gas_mac;
                  }
                  if(dap_config_st.payLoadPedalConfig_.pedal_type==2)
                  {
                    Recv_mac=Brk_mac;
                  }
                }
              }
            }
          }
        }
      #endif
      //joystick value broadcast
      ESPNow_Joystick_Broadcast(joystickNormalizedToInt32);

      if(basic_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_basic_st,sizeof(dap_state_basic_st));
        basic_state_send_b=false;
      }
      if(extend_state_send_b)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_state_extended_st, sizeof(dap_state_extended_st));
        extend_state_send_b=false;
      }
      if(ESPNow_config_request)
      {
        ESPNow.send_message(broadcast_mac,(uint8_t *) & dap_config_st,sizeof(dap_config_st));
        ESPNow_config_request=false;
      }
      if(Config_update_b)
      {
        Config_update_b=false;
        #ifdef USING_BUZZER
          if(dap_config_st_local.payLoadHeader_.storeToEeprom==1)
          {
            Buzzer.single_beep_tone(700,100);
          }          
        #endif 
      }
      if(ESPNow_OTA_enable)
      {
        Serial.println("Get OTA command");
        OTA_enable_b=true;
        OTA_enable_start=true;
        ESPNow_OTA_enable=false;
      }
      if(OTA_update_action_b)
      {
        Serial.println("Get OTA command");
        OTA_enable_b=true;
        OTA_enable_start=true;
        ESPNow_OTA_enable=false;
        Serial.println("get basic wifi info");
        Serial.readBytes((char*)&_basic_wifi_info, sizeof(Basic_WIfi_info));
        #ifdef OTA_update
          if(_basic_wifi_info.device_ID==dap_config_st.payLoadPedalConfig_.pedal_type)
          {
            SSID=new char[_basic_wifi_info.SSID_Length+1];
            PASS=new char[_basic_wifi_info.PASS_Length+1];
            memcpy(SSID,_basic_wifi_info.WIFI_SSID,_basic_wifi_info.SSID_Length);
            memcpy(PASS,_basic_wifi_info.WIFI_PASS,_basic_wifi_info.PASS_Length);
            SSID[_basic_wifi_info.SSID_Length]=0;
            PASS[_basic_wifi_info.PASS_Length]=0;
            OTA_enable_b=true;
          }
          #endif

      }
      if(Get_Rudder_action_b)
      {
        Get_Rudder_action_b=false;
        #ifdef USING_BUZZER
        Buzzer.single_beep_tone(700,100);
        #endif
      }

      if(ESPNOW_BootIntoDownloadMode)
      {
        #ifdef ESPNow_S3
          Serial.println("Restart into Download mode");
          delay(1000);
          REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
          ESP.restart();
        #else
          Serial.println("Command not supported");
          delay(1000);
        #endif
        ESPNOW_BootIntoDownloadMode = false;
      }
      //rudder sync after rudder done initializing
      if(dap_calculationVariables_st.Rudder_status && !Rudder_initializing)
      {              
        dap_calculationVariables_st.current_pedal_position_ratio=((float)(dap_calculationVariables_st.current_pedal_position-dap_calculationVariables_st.stepperPosMin_default))/((float)dap_calculationVariables_st.stepperPosRange_default);
        dap_rudder_sending.payloadRudderState_.pedal_position_ratio=dap_calculationVariables_st.current_pedal_position_ratio;
        dap_rudder_sending.payloadRudderState_.pedal_position=dap_calculationVariables_st.current_pedal_position;
        dap_rudder_sending.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_RUDDER;
        dap_rudder_sending.payLoadHeader_.PedalTag=dap_config_st.payLoadPedalConfig_.pedal_type;
        dap_rudder_sending.payLoadHeader_.version=DAP_VERSION_CONFIG;
        uint16_t crc=0;
        crc = checksumCalculator((uint8_t*)(&(dap_rudder_sending.payLoadHeader_)), sizeof(dap_rudder_sending.payLoadHeader_) + sizeof(dap_rudder_sending.payloadRudderState_));
        dap_rudder_sending.payloadFooter_.checkSum=crc;
        ESPNow.send_message(Recv_mac,(uint8_t *) &dap_rudder_sending,sizeof(dap_rudder_sending));   
        //ESPNow_send=dap_calculationVariables_st.current_pedal_position; 
        //esp_err_t result =ESPNow.send_message(Recv_mac,(uint8_t *) &_ESPNow_Send,sizeof(_ESPNow_Send));                
        //if (result == ESP_OK) 
        //{
        //  Serial.println("Error sending the data");
        //}                
        if(ESPNow_Rudder_Update)
        {
          //dap_calculationVariables_st.sync_pedal_position=ESPNow_recieve;
          dap_calculationVariables_st.sync_pedal_position=dap_rudder_receiving.payloadRudderState_.pedal_position;
          dap_calculationVariables_st.Sync_pedal_position_ratio=dap_rudder_receiving.payloadRudderState_.pedal_position_ratio;
          ESPNow_Rudder_Update=false;
        }                
      }
          
